# AnalysisResultSchema Constructor (String, String)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisResultSchema Constructor (String, String)
AnalysisResultSchema Class See Also
---
Creates object and assigns name and description
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public AnalysisResultSchema(
	string name,
	string description
)
```

Visual Basic
---
```text
Public Sub New ( _
	name As String, _
	description As String _
)
```

Visual C++
---
```text
public:
AnalysisResultSchema(
	String^ name,
	String^ description
)
```

# ### Parameters
name
    Type: System..::..String Name of the result schema
description
    Type: System..::..String Description of the result schema
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AnalysisResultSchema Class
AnalysisResultSchema Overload
Autodesk.Revit.DB.Analysis Namespace